var UNIT = [
	[
		[""],
		["いち"],
		["に"],
		["さん"],
		["よん"],
		["ご"],
		["ろく"],
		["なな"],
		["はち"],
		["きゅう"]
	],
	[
		[],
		["じゅう"],
		["にじゅう"],
		["さんじゅう"],
		["よんじゅう"],
		["ごじゅう"],
		["ろくじゅう"],
		["ななじゅう"],
		["はちじゅう"],
		["きゅうじゅう"],
	],
	[
		[],
		["ひゃく"],
		["にひゃく"],
		["さんびゃく"],
		["よんひゃく"],
		["ごひゃく"],
		["ろっぴゃく"],
		["ななひゃく"],
		["はっぴゃく"],
		["きゅうひゃく"]
	],
	[
		[],
		["せん"],
		["にせん"],
		["さんぜん"],
		["よんせん"],
		["ごせん"],
		["ろくせん"],
		["ななせん"],
		["はっせん"],
		["きゅうせん"]
	],
	[
		[],
		["まん"],
		["おく"],
		["ちょう"],
		["けい"],
		["がい"],
		["じょ"],
		["じょう"],
		["こう"],
		["かん"],
		["せい"],
		["さい"],
		["ごく"],
		["ごうがしゃ"],
		["あそうぎ"],
		["なゆた"],
		["ふかしぎ"],
		["むりょうたいすう"]
	]
	
]
function bango(num) {
	
	var tokens = [];
	do {
		tokens.push(num % 10000);
		num = (num / 10000) | 0;
	} while(num);
	var read = [];
	tokens.forEach(function(num,i){
		read.unshift.apply(read,UNIT[4][i]);
		read.unshift.apply(read,UNIT[0][num % 10]);
		num = (num / 10) | 0;
		read.unshift.apply(read,UNIT[1][num % 10]);
		num = (num / 10) | 0;
		read.unshift.apply(read,UNIT[2][num % 10]);
		num = (num / 10) | 0;
		read.unshift.apply(read,UNIT[3][num % 10]);
	});
	return read.toString().replace(/,/g,"");
}